---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SurfacePerimeter
source: html/34a1a726-01c3-1d4e-66d2-a07d231734af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SurfacePerimeter Property

"Perimeter"

## Syntax (C#)
```csharp
public static ForgeTypeId SurfacePerimeter { get; }
```